from Module15_Tasks.Task2.Task2 import Task2

def test_split_into_two_groups():
    espectedGroup = [
            "Артемий",
            "Борис",
            "Влад",
            "Гоша",
            "Дима",
            "Евгений",
            "Женя",
            "Захар",
            "Игорь",
            "Константин",
            "Максим",
            "Никита",
            "Павел",
            "Роман"
        ]
    assert Task2.split_into_two_groups(espectedGroup) == (['Артемий', 'Влад', 'Дима', 'Женя', 'Игорь', 'Максим', 'Павел'], 
                                                         ['Борис', 'Гоша', 'Евгений', 'Захар', 'Константин', 'Никита', 'Роман'])